Repository: xccui/SPWAF-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The state backend is responsible for storing the local state of each task instance and persisting it to remote storage when a checkpoint is taken.
zh_cn: 状态后端负责存储每个状态实例的本地状态，并在生成检查点时将它们写入远程持久化存储。

source: The state backend notifies the task once its state checkpoint is complete and the task acknowledges the check‐ point at the JobManager.
zh_cn: 状态后端会在状态存为检查点完成后通知任务，然后任务会给JobManager发送确认消息。

source: The state backend of an application is responsible for maintaining the local state, per‐ forming checkpoints and savepoints, and recovering the application state after a fail‐ ure.
zh_cn: 应用状态后端负责维护本地状态、生成检查点和保存点以及在故障时恢复应用状态。

source: The state copies in the savepoint are organized by an operator identifier and a state name.
zh_cn: 保存点中的状态副本会按照算子标识和状态名称进行组织。

source: The state elements can be accessed by calling List State.get(), which returns an Iterable[T] over all state elements.
zh_cn: 还可以使用ListState.get()访问状态元素（它会返回一个可遍历所有元素的Iterable[T]对象）。

source: The state handle object (lastTempState in Example 7-2) is a regular member variable of the function class.
zh_cn: 我们一般会将状态句柄对象（示例7-2中的lastTempState）声明为函数类的常规成员变量。

source: The state handle object only provides access to the state, which is stored an maintained in the state backend.
zh_cn: 状态句柄对象只提供用于访问状态的接口而不会存储状态本身，具体保存工作需要由状态后端来完成。

source: The state name is scoped to the operator so that a function can have more
zh_cn: 状态名称的作用域是整个算子，因此你可以通过在函数中注册多个状态描述符的方式得到多个状态对象。

source: The state of an application that was running for several weeks can be expensive or even impossible to recompute.
zh_cn: 在应用运行较长一段时间后，其状态就会变得成本十分昂贵，甚至无法重新计算。

source: The state of the application is automatically redistributed to the larger or smaller number of parallel operator tasks.
zh_cn: 应用的状态会自动重新分配到更多或更少的并行算子任务上。

source: The state of the window is not changed.
zh_cn: 窗口状态不会发生任何变化。

source: The state primitive offers many of the methods of a regular Java Map such as get(key: K), put(key: K, value:
zh_cn: 该状态原语提供了很多常规Java Map中的方法，例如get(key: K)，put(key: K, value: V)，contains(key: K)，remove(key: K)

source: The state-cleaning mechanism implemented by the above KeyedProcessFunction works as follows.
zh_cn: 上述KeyedProcessFunction实现的状态清除策略的工作机制如下。

source: The stateful streaming application processes events as usual and stores and updates its intermedi‐ ate or final results in a queryable state.
zh_cn: 状态化流式应用可以按照正常流程处理事件，并在可查询状态中对其中间或最终结果进行存储和更新。

source: The steps of this naive algorithm would be:
zh_cn: 朴素算法的步骤包括：

source: The storage location of the local state copy can be specified as well (taskmanager.state.local.root-dirs).
zh_cn: 本地状态副本的存储位置同样可配（taskmanager.state.local.root-dirs）。

source: The storage location of the uploaded JAR file
zh_cn: 上传JAR文件的存储位置

source: The straightforward approach for such use cases is to implement a MapFunction that queries the datastore for every processed record, waits for the query to return a result,
zh_cn: 该用例的一个直观解决方案是实现一个MapFunction，它会针对每一条处理记录去查询数据库并等待结果返回，随后才可以丰富记录并发出结果。

source: The stream of numbers is partitioned into a stream of even and odd numbers.
zh_cn: 数字流会被分成奇数流和偶数流，

source: The stream processor computes approximated results in near real time and writes them into a speed table.
zh_cn: 流处理引擎会近实时地计算出近似结果，并将其写入"提速表"中。

source: The stream processor computes possibly inaccurate results in near real-time and writes the results into a speed table.
zh_cn: 流处理引擎会近实时地计算出一个可能并不精确的结果，随后将其写入"提速表"中。

source: The sum tasks persist the current sum value as state.
zh_cn: 求和算子的任务会把当前和值存为状态。

source: The system needs to efficiently manage the state and make sure it is protected from concurrent updates.
zh_cn: 系统需要高效地管理状态并保证它们不受并发更新的影响。

source: The system scope declares what component of the system the metric refers to and what context information it should include.
zh_cn: 系统域用于声明指标所对应的系统组件及包含的上下文信息。

source: The task can be explicitly canceled at some point in time or terminated in the case of a finite stream when the input is fully consumed.
zh_cn: 其任务可以在某个时间点被显式取消，或是在有限流的情况下待数据完全消费完毕后自动终止。

source: The task can then choose which entries to use and which to dis‐ card.
zh_cn: 随后由任务自己决定哪些条目该保留，哪些该丢弃。

source: The task emits a watermark with the updated event time.
zh_cn: 任务根据更新后的事件时间将水位线发出。

source: The task emits a watermark with the updated event-time.
zh_cn: 根据更新后的事件时间发出水位线记录。

source: The task updates its internal event-time clock based on the watermark’s time‐ stamp.
zh_cn: 基于水位线记录的时间戳更新内部事件时间时钟。

source: The tasks of a running application are continuously exchanging data.
zh_cn: 在运行状态下，应用的任务会持续进行数据交换。

source: The tasks of operators with two or more input streams such as Union or CoFlatMap (see “Multistream Transformations”) also compute their event-time clock as the mini‐ mum of all partition watermarks—they do not distinguish between partition water‐ marks of different input streams.
zh_cn: 对于那些有着两条或多条输入数据流的算子，如Union或CoFlatMap（详见"多流转换"一节），它们的任务同样是利用全部分区水位线中的最小值来计算事件时间时钟，并没有考虑分区是否来自不同的输入流。

source: The tasks of the operator will not be chained to preceding
zh_cn: 该方法会让对应算子的任务断开与之前的任务链接，

source: The tasks of the operators with a parallelism of four are assigned to each slot.
zh_cn: 对于并行度为4的算子，其任务会每个处理槽分配一个。

source: The task’s time service identifies all timers with a time smaller than the updated event time.
zh_cn: 任务的时间服务会找出所有触发时间小于更新后事件时间的计时器。

source: The task’s time service identifies all timers with a time smaller than the updated event-time.
zh_cn: 任务的时间服务会找出所有触发时间小于更新后事件时间的定时器。

source: The third and biggest challenge that comes with stateful operators is ensuring that state can be recovered and results will be correct even in the presence of fail‐ ures.
zh_cn: 最后一个也是最大的挑战在于，状态化算子需要保证状态可以恢复，并且即使出现故障也要确保结果正确。

source: The third generation of distributed open source stream processors (2015) addressed the dependency of results on the timing and order of arriving events.
zh_cn: 第三代分布式流处理引擎（2015年）解决了结果对事件到来时间及顺序的依赖问题。

source: The third generation of distributed open source stream processors (2015) fixed the dependency of results on the timing and order of arriving events.
zh_cn: 第三代分布式流处理引擎（2015年）修复了结果对事件到来时间及顺序的依赖问题。

source: The third parameter is a Properties object that configures the Kafka client that is internally used to connect to and read from Kafka.
zh_cn: 第三个参数是一个Properties对象，它用于配置连接器内部负责连接和从Kafka读取数据的Kafka客户端。

source: The time interval can be set in milliseconds, seconds, minutes, hours, or
zh_cn: 时间间隔允许以毫秒、秒、分钟、小时或天数来表示。

source: The timer will fire when the processing time of the
zh_cn: 当执行机器的处理时间到达给定的时间戳时，该计时器就会触发。

source: The timer will fire when the watermark is updated to a
zh_cn: 当更新后的水位线时间戳大于或等于计时器的时间戳时，它就会触发。

source: The timestamp argument gives the timestamp of the firing timer and the Collec
zh_cn: timestamp参数给出了所触发计时器的时间戳，Collector可用来发出记录。

source: The timestamp associates an record with a specific point in time, usually the point in time at which the event that is represented by the record happened.
zh_cn: 时间戳将记录和特定时间点进行关联，这些时间点通常是记录所表示事件的发生时间。

source: The traditional approach of a periodic ETL job to move data between storage systems is typically not able to propagate updates fast enough.
zh_cn: 传统方式是通过定期执行ETL作业来转移数据，但这种更新传播方式往往不够迅速。

source: The traditional architecture that most businesses implement distinguishes two types of data process‐
zh_cn: 绝大多数企业所实现的传统架构都会将数据处理分为两类：事务型处理和分析型处理。

source: The transformation logic can be either integrated in the operator or provided by a user-defined function (UDF), as shown in Figure 2-4.
zh_cn: 如图2-4所示，具体转换逻辑可以是算子内置的，也可以由用户自定义函数（UDF）提供。

source: The transformation logic can be either integrated in the operator or provided by a user-defined function, as shown in Figure 2-4.
zh_cn: 如图2-4所示，转换逻辑可以是算子内置的，也可以由用户自定义函数提供。

source: The trigger defines (fires) when a window is considered ready for evaluation and when a window is purged and its contents are cleared.
zh_cn: 触发器定义了窗口何时准备好执行计算（触发），何时需要清除自身及保存的内容。

source: The trigger fires at most every second.
zh_cn: 触发周期不小于一秒。

source: The trigger registers a timer when the first event is assigned to a window, 1 second ahead of the current watermark.
zh_cn: 它在第一个事件分配给窗口时注册了一个比当前水位线快1秒的计时器。

source: The truth is, processing time can indeed be useful in some cases.
zh_cn: 事实上，处理时间的确有其特定的适用场景。

source: The tuple classes are strongly typed.
zh_cn: 这些元组类都是强类型的。

source: The two tasks of operators C and E are assigned to slots 1.1 and 2.1 and slots 1.2 and 2.2, respectively.
zh_cn: 其余两个算子C和E的任务会分别放到处理槽1.1、2.1和处理槽1.2、2.2中。

source: The two tasks of operators C and E are assigned to slots 1.1 and 2.1 and slots 1.2 and 2.2, respectively1.
zh_cn: 其余两个算子C和E的任务会分别放到处理槽1.1、2.1和处理槽1.2、2.2中1。

source: The two types of pods—master and worker—behave just like the processes of a standalone or Docker deployment we described before.
zh_cn: 这两类Pod（主进程和工作进程）的工作原理和我们之前介绍的独立集群模式以及Docker部署模式中的进程相同。

source: The type of the output stream is the same as the
zh_cn: 因此输出流的类型会永远和输入流保持一致。

source: The type of the queryable state is ValueState, which holds values of the type of the input stream—our example (String, Double).
zh_cn: 可查询式状态的类型是ValueState，它内部的数据类型和输入流的类型相同（在我们示例中即(String, Double)）。

source: The type parameters of the function define its input and output types.
zh_cn: 函数的类型参数定义了输入和输出的数据类型。

source: The types of guarantees you have seen so far refer to the state of an application that is managed by the stream processor.
zh_cn: 至今为止你看到的保障类型都仅限于流处理引擎自身的应用状态。

source: The types of guarantees you have seen so far refer to the stream processor component only.
zh_cn: 至今为止你看到的保障类型都仅限于流处理引擎组件。

source: The ubiquitous problem of out-of-order data can also be solved with it.
zh_cn: 时常产生的无序问题也可以借此解决。

source: The unique identifier and maximum parallelism of operators are baked into a savepoint and cannot be changed.
zh_cn: 算子的唯一标识和最大并行度会被固化到保存点中，不可更改。

source: The updates are written to and distributed by the event log.
zh_cn: 具体而言就是将更新写入事件日志系统，并由它进行分发。

source: The voting phase of the 2PC protocol starts when the JobManager initiates a checkpoint and injects barriers in the sources of the application.
zh_cn: 2PC协议的投票阶段始于JobManager对某个检查点进行初始化并向应用数据源中注入分隔符。

source: The way operators interact with state has implications on the robustness and perfor‐ mance of an application.
zh_cn: 算子和状态的交互会对应用的鲁棒性及性能产生一定影响。

source: The window content holds the elements that have been assigned to the window or the result of the incremental aggregation in case the window operator has a
zh_cn: 窗口内容包含了分配给窗口的元素，或当窗口算子配置了ReduceFunction或AggregateFunction时增量聚合所得到的结果。

source: The window definition looked a bit different in our first DataStream API example, “Operations on Data Streams” on page 22.
zh_cn: 在第22页"数据流上的操作"一节，我们第一个DataStream API示例中定义窗口的方式看上去有些不同。

source: The window operator API provides a method to explicitly declare that you expect late elements.
zh_cn: 窗口算子API提供了一个方法，可用来显式声明支持迟到的元素。

source: The window operator deletes a window when the end time of the window, defined by the end timestamp of the window object, is reached.
zh_cn: 窗口算子会在窗口结束时间（由窗口对象中的结束时间戳定义）到达时删除窗口。

source: The window operator groups elements based on the returned objects.
zh_cn: 窗口算子会根据返回的对象对元素进行分组。

source: The window result will not depend on how fast the stream is read or processed.
zh_cn: 窗口结果不会取决于数据流的读取或处理速度。

source: The worker containers are based on the same
zh_cn: 其容器所需的Flink Docker镜像和主进程Deployment的完全相同，

source: The worker deployment looks almost identical to the master deployment with a few differences.
zh_cn: 工作进程的Deployment和主进程的Deployment几乎一模一样，二者只有几点不同。

source: The worker process to which a task is assigned, the tasks that are colocated with a task, and the number of tasks that are assigned to a worker process can have a significant impact on an application’s performance.
zh_cn: 任务分配的目标工作进程，任务的共存情况以及工作进程中的任务数都会对应用性能带来显著影响。

source: The yellow slot-sharing group requires two slots.
zh_cn: yellow处理槽共享组只需2个处理槽。

source: The “Extract hashtags" and “Count" operators have two parallel operator tasks, each performing a computation on a subset of the input data.
zh_cn: "Extract hashtags"和"Count"算子都包含两个并行算子任务，每个任务负责计算一部分输入数据。

source: The behavior of windows is defined by a set of policies.
zh_cn: 窗口的行为是由一组策略定义的，

source: Then suddenly the train enters a tunnel and her phone gets dis‐ connected.
zh_cn: 突然，地铁开进隧道，手机断网了。

source: Then suddenly, the train enters a tunnel and her phone gets dis‐ connected.
zh_cn: 突然，地铁开进隧道，手机断网了，

source: Then we introduced the idea of stateful stream processing and explained how it addresses a wide spectrum of use cases, rang‐ ing from business applications and microservices to ETL and data analytics.
zh_cn: 随后我们介绍了状态化流处理的基本思想，解释了它如何处理从业务应用和微服务到ETL和数据分析的多种用例。

source: Then, can you somehow get both low latency and high throughput or is this a hope‐ less endeavour?
zh_cn: 既然这样，可以通过某种方式同时获得低延迟和高吞吐吗？还是说根本不切实际？

source: Then, we use the keyBy() transformation to parti‐ tion the sensor readings by their sensor ID.
zh_cn: 然后我们使用keyBy()转换，将传感器读数按照传感器ID进行分区。

source: Then, we will cover the process functions, low-level transformations that provide access to timestamps and watermarks and can register timers.
zh_cn: 随后我们会介绍处理函数，它对应的底层转换可以访问时间戳和水位线，还能注册计时器。

source: There are a few more notable configuration options.
zh_cn: 还有一些我们认为值得关注的配置选项。

source: There are a few parameters in the ./conf/flink- conf.yaml configuration file you can use to control Flink’s recovery behavior on YARN.
zh_cn: 你可以通过./conf/flink-conf.yaml配置文件来控制Flink在YARN上的故障恢复行为。

source: There are a few things to consider when running a Flink application with a Kafka sink that operates in exactly-once mode, and it helps to roughly understand how Kafka processes transactions.
zh_cn: 如果你为Flink应用配置了在精确一次模式下工作的Kafka数据汇，则要考虑一些问题，它们将帮助你对Kafka的事务处理有一个大概的认识。

source: There are also applications that do not emit results but keep them internally to serve them via Flink’s queryable state feature.
zh_cn: 还有一些应用不会发出结果，而是将它们保存在内部，利用Flink的可查询式状态（queryable state）功能对外提供服务。

source: There are also constructor variants to enable or disable asynchronous checkpointing
zh_cn: 其他一些构造函数可用来选择是否开启异步检查点（默认开启）：

source: There are different types of transformations.
zh_cn: 转换的类型多种多样：

source: There are different ways to specify keys.
zh_cn: 指定键值的方式多种多样，

source: There are many popular libraries out there, such as Apache Commons or Google Guava, for various use cases.
zh_cn: 很多流行库（例如：Apache Commons或Google Guava）会用于各种不同的用例场景中。

source: There are rich versions of all the DataStream API transformation functions, and you can use them in the same places you can use a regular function or lambda function.
zh_cn: DataStream API中的所有转换函数都有对应的富函数，它们允许的使用位置和普通函数以及Lambda函数相同。

source: There are several aspects that affect the behavior of an appli‐ cation such as the choice of the state backend that locally maintains the state and performs checkpoints, the configuration of the checkpointing algorithm, and the size of the application’s state.
zh_cn: 这些影响的原因是多方面的，例如：对于用来维护本地状态和生成检查点的状态后端的选择，配置的检查点生成算法以及应用状态大小等。

source: There are several event log sys‐ tems available as open source software, Apache Kafka being the most popular, or as integrated services offered by cloud computing providers.
zh_cn: 有不少事件日志系统会以开源软件或云计算集成服务的形式出现，其中最流行的当属Apache Kafka。

source: There are some ideas to support this case by offering an offline tool to convert savepoints.
zh_cn: 有一些思路是通过提供一个用来转换保存点的离线工具来支持这种情况，

source: There are three ways to provide Flink with Hadoop dependencies:
zh_cn: 为Flink添加Hadoop依赖的方式有三种：

source: There are two aspects of triggers that require special care: cleaning up state and merging triggers.
zh_cn: 但有两类触发器需要格外小心：状态清理触发器及合并触发器。

source: There are two failure cases that can result in records being emitted
zh_cn: 有两种故障会导致记录发出多次：

source: There are two options for externalized checkpoints:
zh_cn: 外化检查点有两个选项：

source: There are two techniques that sink connectors can apply in dif‐ ferent situations to achieve exactly-once guarantees: idempotent writes and transactional writes.
zh_cn: 根据情况不同，这些连接器可以使用两种技术来实现精确一次保障：幂等性写（idempotent write）以及事务性写（transactional write）。

source: There are two types of functions that can be applied on a window:
zh_cn: 可用于窗口的函数类型有两种：

source: There are two types of state, operator state and keyed state, that are accessible from different scopes and discussed in the following sections.
zh_cn: 根据作用域的不同，状态可以分为两类：算子状态（operator state）和键值分区状态（keyed state），我们将在接下来的几节介绍它们。

source: There are two ways state can be modified:
zh_cn: 我们有两种办法可以对状态进行修改：

source: There are two ways to ensure all dependencies are available to an application when it is executed:
zh_cn: 有两种方法可以保证在执行应用时可以同时使用所有依赖：

source: There are two ways to provide TypeInformation.
zh_cn: 其方法有二。

source: There exists a vibrant community around Flink and we encourage you to connect with other users, start contributing, or find out what companies are building with Flink to help inspire your own work.
zh_cn: 围绕Flink有一个充满活力的社区，我们鼓励你接触一下其他用户，开始为社区做一些贡献或从别的Flink公司用户那里寻求一些启发。

source: There is also a service that exposes the ports of the master pod to the worker pods.
zh_cn: 此外还有一个Service，用于将主进程Pod的端口暴露给工作进程所在Pod。

source: There is also the option to delegate the partitioning to Kafka based on the message key.
zh_cn: 此外还可以选择让Kafka根据消息的键值来完成分区。

source: There, we defined an event-time tumbling
zh_cn: 那里，我们使用timeWindow(size)方法定义了一个事件时间滚动窗口。

source: Therefore, a common technique to continuously ingest files is to write them in a temporary directory and atomically move them to the monitored directory once they are finalized.
zh_cn: 因此持续读取文件的常用技术是把它们写入一个临时目录，并在最后以原子操作的方式将它们移动到监视目录中。

source: Therefore, a function can only access the state that belongs to the record it currently processes.
zh_cn: 这样，函数每次只能访问属于当前处理记录的状态。

source: Therefore, a stand‐ alone Flink cluster requires standby Dispatcher and TaskManager processes that can take over the work of failed processes.
zh_cn: 因此，在独立集群模式下，Flink需要后备Dispatcher和TaskManager进程，用来接管故障进程的工作。

source: Therefore, all configuration values are preserved after the object is deserialized.
zh_cn: 这样在对象反序列化后，全部配置值都可以保留。

source: Therefore, filesystems are commonly used to “connect” streaming and batch applications.
zh_cn: 因此，我们通常会用它来"连接"流式应用和批处理应用。

source: Therefore, it does not work with the Windows command line.
zh_cn: 因此无法在Windows命令行下运行。

source: Therefore, it is important that application state can be migrated to a new version of the application or be redistributed to more or fewer operator tasks.
zh_cn: 所以说，能够将应用状态迁移到一个新版本的应用或重新分配到不同数量的算子任务上就变得十分重要。

source: Therefore, it is not necessary to define data types to hold keys and values, which avoids a lot of boilerplate code.
zh_cn: 因此，没有必要为键和值再单独定义数据类型，这样可以省去大量样板代码。

source: Therefore, many applications must be able to automatically recover from failure of any process involved in the execution.
zh_cn: 因此，很多应用必须能够从执行过程所涉及的任意应用故障中自动恢复。

source: Therefore, resettable sources and Flink’s recovery mechanism are not sufficient to provide end-to-end exactly-once guarantees even though the application state is exactly-once consistent.
zh_cn: 因此，可重置的数据源以及Flink的恢复机制虽然可以为应用状态提供精确一次的一致性保障，但无法提供端到端的精确一次保障。

source: Therefore, such changes are not safepoint compatible even though they look unobtrusive.
zh_cn: 因此，这些看上去不惹眼的改动其实并非是保存点兼容的。

source: Therefore, the asyncInvoke() method should quickly return by starting an asynchro‐ nous request and handling the result with a callback that forwards the result to ResultFuture.
zh_cn: 因此asyncInvoke()方法需要在发出异步请求后立即返回，并处理回调函数将结果发给ResultFuture。

source: Therefore, the operator emits a result that is incomplete or inaccurate.
zh_cn: 这表示算子之前发出的结果可能是不完整或不准确的。

source: Therefore, the trigger fires, at most, every second.
zh_cn: 因此该触发器最多每秒触发一次。

source: Therefore, we strongly recommend manually assign‐ ing unique identifiers to operators and not relying on Flink’s default assignment.
zh_cn: 所以我们强烈建议手工指定算子标识，而不要依赖Flink的默认分配机制。

source: These are the most widely used connectors and they also represent important types of source and sink systems.
zh_cn: 这些连接器的应用最为广泛，同时上面所列出的也代表了几类重要的数据源和数据汇系统。

source: These chapters guide you through setting up a development environment, cover the basics of the DataStream API, and go into the details of Flink’s time seman‐ tics and window operators, its connectors to external systems, and the details of Flink’s fault-tolerant operator state.
zh_cn: 这些章节将指导你完成开发环境设置，学习DataStream API的基础知识，深入了解Flink的时间语义、窗口算子、外部系统连接器以及Flink容错性operator state的细节。

source: These components are a JobManager, a ResourceManager, a TaskManager, and a Dispatcher.
zh_cn: 这些组件是：JobManager、ResourceManager、TaskManager和Dispatcher。

source: These components need to be carefully orchestrated and especially error handling and failure recovery can become challenging.
zh_cn: 这些组件需要仔细地协调，尤其是错误处理和故障恢复可能颇具挑战。

source: These fea‐ tures are disabled by default and can be enabled by adding the parameter
zh_cn: 该功能默认情况下是关闭的，你可以通过在Properties对象中为配置属性flink.partition-discovery.interval-millis设置一个非负的值来启用它。

source: These functions are typically very space-efficient and eventually emit the aggregated value as a
zh_cn: 此类函数函数通常会十分节省空间且最终会将聚合值作为单个结果发送出去。

source: These include more fine-grained statistics about your tasks, such as buffer usage, watermarks, and input/output rates.
zh_cn: 这些指标包含了有关任务细粒度的统计信息，例如缓冲区的使用情况、水位线以及输入输出速率。

source: These metrics are assembled into reports that help the management to assess the business’s overall health.
zh_cn: 将这些指标整合成报告，能够帮助管理层评估企业整体健康状况。

source: These metrics are assembled into reports that help to assess the situation of the business.
zh_cn: 在报告中汇总这些指标，有助于评估业务状况；

source: These operations consume one event after the other and apply some trans‐ formation to the event data, producing a new output stream.
zh_cn: 这些操作挨个读取事件，对其应用某些转换并产生一条新的输出流。

source: These operations define how events are assigned to tasks.
zh_cn: 这些操作定义了如何将事件分配给不同任务。

source: These operators can be combined into dataflow processing graphs to implement the logic of streaming applications.
zh_cn: 这些算子可以组合生成Dataflow处理图，从而实现流式应用所需的逻辑。

source: These parameters are a unique operator identifier and the maximum parallelism (for opera‐ tors with keyed state).
zh_cn: 这两个参数是算子唯一标识和最大并行度（只针对具有键值分区状态的算子）。

source: These systems are typically designed with separate tiers for data processing (the application itself) and data storage (a transactional database system) as shown in Figure 1-1.
zh_cn: 如图1-1所示，这些应用系统通常都会设置独立的数据处理层（应用程序本身）和数据存储层（事务型数据库系统）。

source: These systems had rather low-level APIs and did not provide built-in support for accurate and con‐ sistent results of streaming applications because the results depended on the timing and order of arriving events.
zh_cn: 它们的API非常底层，而且并未针对流式应用结果的准确性和一致性提供内置保障。其结果完全取决于事件到达的时间和顺序。

source: These systems had rather low-level APIs and did not provide built-in support for accurate and consistent results of streaming applications because the results depended on the timing and order of arriving events.
zh_cn: 它们的API非常底层，而且并未针对流式应用结果的准确性和一致性提供内置保障。其结果完全取决于事件到达的时间和顺序。

source: These tasks can be of the same operator (data parallelism), a different operator (task parallelism), or even from a different application (job parallelism).
zh_cn: 这些任务可以属于同一个算子（数据并行），也可以是不同算子（任务并行），甚至还可以来自不同的应用（作业并行）。

source: These tasks can be sub‐ tasks of the same operator (data parallelism), a different operator (task parallelism), or even from a different application (job parallelism).
zh_cn: 这些任务可以属于同一个算子（数据并行），也可以是不同算子（任务并行），甚至还可以来自不同的应用（作业并行）。

source: These timers are maintained by the window operator.
zh_cn: 这些计时器由窗口算子负责维护。

source: These two interfaces extend the Time stampAssigner interface provided by the DataStream API.
zh_cn: 这两个接口都继承自DataStream API所提供的TimestampAssigner接口，

source: They also support
zh_cn: 同时还支持选择嵌套字段。

source: They are called on a stream of elements and produce a new stream of timestamped elements and water‐
zh_cn: 它们会作用在数据流的元素上面，生成一条带有时间戳和水位线的新数据流。
